tutorials/multiphase/compressibleInterFoam/les/depthCharge2D/0/p_rgh.org
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    walls
    {
        type            buoyantPressure;
        value           uniform 1e5;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
