tutorials/multiphase/compressibleInterFoam/les/depthCharge2D/constant/polyMesh/boundary
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    walls
    {
        type            wall;
        nFaces          480;
        startFace       25360;
    }
    frontAndBack
    {
        type            empty;
        nFaces          25600;
        startFace       25840;
    }
)

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
